In [3]:
import pandas as pd 
   
# create a new data frame 
df = pd.DataFrame({'Name': ['John Larter', 'Robert Junior', 'Jonny Depp'], 
                   'Age':[32, 34, 36]}) 
df

            Name  Age
0    John Larter   32
1  Robert Junior   34
2     Jonny Depp   36

## Series.str.split()

In [7]:
df.Name.str.split(expand=True)

        0       1
0    John  Larter
1  Robert  Junior
2   Jonny    Depp

In [8]:
df[['First_Name','Last_Name']]=df.Name.str.split(expand=True)

In [9]:
df

            Name  Age First_Name Last_Name
0    John Larter   32       John    Larter
1  Robert Junior   34     Robert    Junior
2     Jonny Depp   36      Jonny      Depp

### Use underscore as delimiter to split the column into two columns.

In [10]:
df = pd.DataFrame({'Name': ['John_Larter', 'Robert_Junior', 'Jonny_Depp'], 
                    'Age':[32, 34, 36]}) 
   
print("Given Dataframe is :\n",df)

Given Dataframe is :
             Name  Age
0    John_Larter   32
1  Robert_Junior   34
2     Jonny_Depp   36

In [11]:
df[['First_Name','Last_Name']]=df.Name.str.split('_',expand=True)

In [12]:
df

            Name  Age First_Name Last_Name
0    John_Larter   32       John    Larter
1  Robert_Junior   34     Robert    Junior
2     Jonny_Depp   36      Jonny      Depp

### Use str.split(), tolist() function together.

In [13]:
df = pd.DataFrame({'Name': ['John_Larter', 'Robert_Junior', 'Jonny_Depp'], 
                    'Age':[32, 34, 36]}) 
   
print("Given Dataframe is :\n",df)

Given Dataframe is :
             Name  Age
0    John_Larter   32
1  Robert_Junior   34
2     Jonny_Depp   36

In [18]:
df.Name.str.split('_',n=1).tolist()

[['John', 'Larter'], ['Robert', 'Junior'], ['Jonny', 'Depp']]

## n-->control no of times we want to split the iterable
n=None,0,-1-->all split

In [19]:
df1=pd.DataFrame(df.Name.str.split('_',n=1).tolist(),columns=['First_Name','Last_Name'])

In [20]:
df1

  First_Name Last_Name
0       John    Larter
1     Robert    Junior
2      Jonny      Depp

### Method #2 : Using apply() function. Split Name column into two different columns.

In [21]:
df = pd.DataFrame({'Name': ['John_Larter', 'Robert_Junior', 'Jonny_Depp'], 
                    'Age':[32, 34, 36]}) 
   
print("Given Dataframe is :\n",df)

Given Dataframe is :
             Name  Age
0    John_Larter   32
1  Robert_Junior   34
2     Jonny_Depp   36

In [29]:
df.Name.apply(lambda x:pd.Series(x.split('_')))

        0       1
0    John  Larter
1  Robert  Junior
2   Jonny    Depp

#### Split Name column into two different columns named as “First” and “Last” respectively and then add it to the existing Dataframe.

In [30]:
df = pd.DataFrame({'Name': ['John_Larter', 'Robert_Junior', 'Jonny_Depp'], 
                    'Age':[32, 34, 36]}) 
   
print("Given Dataframe is :\n",df)

Given Dataframe is :
             Name  Age
0    John_Larter   32
1  Robert_Junior   34
2     Jonny_Depp   36

In [35]:
df[['First','Last']]=df.Name.apply(lambda x:pd.Series(x.split('_')))

In [36]:
df

            Name  Age   First    Last
0    John_Larter   32    John  Larter
1  Robert_Junior   34  Robert  Junior
2     Jonny_Depp   36   Jonny    Depp